11/data/attachments/e3ea7fbe4ef7f14a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_11588301-da1c-4fd6-9680-fbe35f805990</nif:username>
            <nif:friendToBeAdded>Christopher_responsibility_Friend_22533_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>